;*******************************************************************************************
;  FILE:   XCom RustyUnderlay Localisation.uc                                    
;  
;	File created by RustyDios	06/12/19	12:35	
;	LAST UPDATED				11/03/21	13:30
;
;*******************************************************************************************

;add desc for the tactical icon
[PurifierAutopsyVestBonus X2AbilityTemplate]
LocFriendlyName="强化衬底"
LocLongDescription="<font color = '#FA6942'>*****</font>\n这个防御性通用物品，给予穿戴的<Ability:ClassName/>额外加成。\n<Ability:RUSTYUNDERLAY_HP/><Ability:RUSTYUNDERLAY_OFFENSE/><Ability:RUSTYUNDERLAY_MOBILITY/><Ability:RUSTYUNDERLAY_WILL/><Ability:RUSTYUNDERLAY_DODGE/><Ability:RUSTYUNDERLAY_DEFENSE/><Ability:RUSTYUNDERLAY_HACK/><Ability:RUSTYUNDERLAY_PSIOFF/><Ability:RUSTYUNDERLAY_CRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGCRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGAIM/><Ability:RUSTYUNDERLAY_ARMOURPIPS/><Ability:RUSTYUNDERLAY_ABLATIVESHIELDS/>"
LocHelpText="<font color = '#FA6942'>*****</font>\n这个防御性通用物品，给予穿戴的<Ability:ClassName/>额外加成。\n<Ability:RUSTYUNDERLAY_HP/><Ability:RUSTYUNDERLAY_OFFENSE/><Ability:RUSTYUNDERLAY_MOBILITY/><Ability:RUSTYUNDERLAY_WILL/><Ability:RUSTYUNDERLAY_DODGE/><Ability:RUSTYUNDERLAY_DEFENSE/><Ability:RUSTYUNDERLAY_HACK/><Ability:RUSTYUNDERLAY_PSIOFF/><Ability:RUSTYUNDERLAY_CRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGCRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGAIM/><Ability:RUSTYUNDERLAY_ARMOURPIPS/><Ability:RUSTYUNDERLAY_ABLATIVESHIELDS/>"

;add desc for an in armoury icon
[RustyUnderlayPassive X2AbilityTemplate]
LocFriendlyName="强化衬底生效中"
LocLongDescription="<font color = '#FA6942'>***</font>\n这个防御性通用物品受益于强化衬底，可激活以下加成:\n<Ability:RUSTYUNDERLAY_HP/><Ability:RUSTYUNDERLAY_OFFENSE/><Ability:RUSTYUNDERLAY_MOBILITY/><Ability:RUSTYUNDERLAY_WILL/><Ability:RUSTYUNDERLAY_DODGE/><Ability:RUSTYUNDERLAY_DEFENSE/><Ability:RUSTYUNDERLAY_HACK/><Ability:RUSTYUNDERLAY_PSIOFF/><Ability:RUSTYUNDERLAY_CRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGCRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGAIM/><Ability:RUSTYUNDERLAY_ARMOURPIPS/><Ability:RUSTYUNDERLAY_ABLATIVESHIELDS/>"
LocHelpText="<font color = '#FA6942'>***</font>\n这个防御性通用物品受益于强化衬底，可激活以下加成:\n<Ability:RUSTYUNDERLAY_HP/><Ability:RUSTYUNDERLAY_OFFENSE/><Ability:RUSTYUNDERLAY_MOBILITY/><Ability:RUSTYUNDERLAY_WILL/><Ability:RUSTYUNDERLAY_DODGE/><Ability:RUSTYUNDERLAY_DEFENSE/><Ability:RUSTYUNDERLAY_HACK/><Ability:RUSTYUNDERLAY_PSIOFF/><Ability:RUSTYUNDERLAY_CRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGCRITCHANCE/><Ability:RUSTYUNDERLAY_FLANKINGAIM/><Ability:RUSTYUNDERLAY_ARMOURPIPS/><Ability:RUSTYUNDERLAY_ABLATIVESHIELDS/>"

;change the pop-up message after autopsy to be a bit more generic
[XComGame.UIAlert]
[UIAlert]
;-m_strReinforcedUnderlayBody=The ADVENT Purifier armor features a number of improvements designed by ADVENT to enhance their tolerance of environmental hazards. We've mirrored some of these changes to increase the durability of our armor underlays. All vest utility items now provide an extra +1 health. 
m_strReinforcedUnderlayBody=变种人净化者的护甲经过变种人的特殊改造，提升了对灾害的抵御程度。我们已经掌握运用了其中的部分技术，以提高我们的防御背心护甲衬底的效能。大多数防御性通用物品现在都能提供额外加成。 
